perf-tests/load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  perf-tests/load-test.jmx
  JMeter Load Test - POS Transaction Flow
  
  This load test simulates a complete POS transaction flow:
    1. Price lookup (pricing-service)
    2. Tax calculation (tax-service)
    3. Payment authorization (payment-gateway)
  
  Targets local Phase-1 services via BASE_URL variable.
  Run with: jmeter -n -t perf-tests/load-test.jmx -l results/load-test.csv -JBASE_URL=http://localhost
  
  Variables:
    - BASE_URL: Base URL for services (default: http://localhost)
    - THREADS: Number of concurrent users (default: 10)
    - RAMP_UP: Ramp-up time in seconds (default: 30)
    - DURATION: Test duration in seconds (default: 120)
    - THROUGHPUT: Requests per minute per user (default: 6)
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <!-- Test Plan -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="POS Load Test Plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(BASE_URL,http://localhost)}</stringProp>
          </elementProp>
          <elementProp name="PRICING_PORT" elementType="Argument">
            <stringProp name="Argument.name">PRICING_PORT</stringProp>
            <stringProp name="Argument.value">8081</stringProp>
          </elementProp>
          <elementProp name="TAX_PORT" elementType="Argument">
            <stringProp name="Argument.name">TAX_PORT</stringProp>
            <stringProp name="Argument.value">8083</stringProp>
          </elementProp>
          <elementProp name="PAYMENT_PORT" elementType="Argument">
            <stringProp name="Argument.name">PAYMENT_PORT</stringProp>
            <stringProp name="Argument.value">8084</stringProp>
          </elementProp>
          <elementProp name="TEST_SKU" elementType="Argument">
            <stringProp name="Argument.name">TEST_SKU</stringProp>
            <stringProp name="Argument.value">SKU-1001</stringProp>
          </elementProp>
          <elementProp name="TEST_REGION" elementType="Argument">
            <stringProp name="Argument.name">TEST_REGION</stringProp>
            <stringProp name="Argument.value">CA</stringProp>
          </elementProp>
          <elementProp name="TEST_CARD" elementType="Argument">
            <stringProp name="Argument.name">TEST_CARD</stringProp>
            <stringProp name="Argument.value">4111111111111111</stringProp>
          </elementProp>
          <elementProp name="TEST_MERCHANT" elementType="Argument">
            <stringProp name="Argument.name">TEST_MERCHANT</stringProp>
            <stringProp name="Argument.value">TEST_MERCHANT_001</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>
      <!-- User Defined Variables -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${BASE_URL}</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>

      <!-- HTTP Request Defaults -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <boolProp name="HTTPSampler.image_parser">false</boolProp>
        <boolProp name="HTTPSampler.concurrentDwn">false</boolProp>
        <boolProp name="HTTPSampler.useKeepAlive">true</boolProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- HTTP Header Manager -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="Accept" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- Thread Group -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test Thread Group">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <intProp name="ThreadGroup.num_threads">${__P(THREADS,10)}</intProp>
        <intProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,30)}</intProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION,120)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>

      <hashTree>
        <!-- Throughput Controller - Controls transaction rate -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller">
          <intProp name="ThroughputController.style">1</intProp>
          <doubleProp>
            <name>ThroughputController.throughput</name>
            <value>${__P(THROUGHPUT,6)}</value>
          </doubleProp>
          <stringProp name="ThroughputController.perThread">true</stringProp>
        </ThroughputController>

        <hashTree>
          <!-- 1. Price Lookup -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 - Price Lookup">
            <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
            <intProp name="HTTPSampler.port">${PRICING_PORT}</intProp>
            <stringProp name="HTTPSampler.path">/price/${TEST_SKU}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Price Response Validation">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">price</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must contain 'price'</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status Code 200">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49587">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must be 200 OK</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>

          <!-- 2. Tax Calculation -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 - Tax Calculation">
            <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
            <intProp name="HTTPSampler.port">${TAX_PORT}</intProp>
            <stringProp name="HTTPSampler.path">/tax</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <stringProp name="HTTPSampler.postBodyRaw">
{
  "subtotal": ${__groovy(org.apache.jmeter.util.JMeterUtils.getProperty("price_result.price", 1.0))},
  "region": "${TEST_REGION}"
}
            </stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Tax Response Validation">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49588">tax_amount</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must contain 'tax_amount'</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status Code 200">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49589">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must be 200 OK</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>

          <!-- 3. Payment Authorization -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 - Payment Authorization">
            <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
            <intProp name="HTTPSampler.port">${PAYMENT_PORT}</intProp>
            <stringProp name="HTTPSampler.path">/payment/authorize</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <stringProp name="HTTPSampler.postBodyRaw">
{
  "amount": ${__groovy(org.apache.jmeter.util.JMeterUtils.getProperty("tax_result.total", 1.0))},
  "currency": "USD",
  "card_number": "${TEST_CARD}",
  "card_expiry": "12/25",
  "cvv": "123",
  "merchant_id": "${TEST_MERCHANT}",
  "order_id": "LOAD-ORDER-${__threadNum}-${__time(,)}"
}
            </stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Payment Response Validation">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49590">status</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must contain 'status'</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status Code 200 or 402">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49591">200</stringProp>
                <stringProp name="49592">402</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Response must be 200 OK or 402 Payment Required</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">5</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- Transaction Controller - Groups the three requests as one transaction -->
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Transaction Controller">
          <boolProp name="TransactionController.includeTimers">true</boolProp>
          <boolProp name="TransactionController.parent">true</boolProp>
        </TransactionController>
        <hashTree/>
      </hashTree>

      <!-- Aggregate Report Listener -->
      <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/load-test.csv</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- View Results Tree (disabled by default) -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
        <stringProp name="filename">results/load-test-details.csv</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- Summary Report -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/summary-report.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>